In [1]:
import sqlite3

buatlah db dengan nama toko_andalan

In [2]:
conn = sqlite3.connect('toko_andalan.db')
print("Opened database successfully")

Opened database successfully

buatlah tabel produk dan sales
- produk :
  1. id INT primary key
  2. nama_product varchar
  3. harga INT

- Sales :
  1. order_id INT primary key
  2. product_id INT Foreign key tabel produk
  3. jumlah INT

In [ ]:
conn.execute('''CREATE TABLE users (username varchar(255), email varchar(255));''')
print("Table created successfully")

conn.close()

Isilah dr 2 tabel diatas dengan
- produk :
  nama_product, harga
  sepatu, 5000
  kemeja, 4000
  sendal, 1000
  kaos kaki, 500
  topi, 1000

- sales:
  product_id, jumlah
  1, 20
  1, 15
  4, 15
  3, 5
  2, 9
  1, 7
  5, 36

update harga kemeja menjadi 5000

join kedua tabel dengan iner join tampilkan kolom nama_produk(produk), harga(produk), jumlah (order)